In [1]:
import pandas as pd

In [3]:
property_data = pd.read_csv('property_data.csv')
property_data

,lai,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT
0,100001000,104,PUTNAM,Y,3.0,1.0,900.0
1,100002000,197,LXT,N,1.0,1.0,NaN
2,100003000,199,LEXINGTON,N,NaN,1.0,850.0
3,100004000,201,berkeley,Y,1.0,NaN,700.0
4,100004000,201,berkeley,Y,1.0,NaN,700.0
5,100005000,203,BERKELEY,Y,3.0,2.0,975.0
6,100006000,207,Berkeley,Y,NaN,1.0,800.0
7,100007000,209,WASHINGTON,NaN,2.0,1.0,950.0
8,100008000,213,TREMONT,Y,1.0,1.0,NaN
9,100009000,215,TREMONT,Y,NaN,2.0,88000.0
10,100007000,209,WASHINGTON,NaN,2.0,1.0,950.0

In [4]:
property_data.dtypes

lai               int64
ST_NUM            int64
ST_NAME          object
OWN_OCCUPIED     object
NUM_BEDROOMS    float64
NUM_BATH        float64
SQ_FT           float64
dtype: object

In [5]:
# meghitung nilai mean pada kolom SQ_FT
med_SQ = property_data["SQ_FT"].median()
print(med_SQ)

900.0

In [6]:
# Menginput NaN pada kolom SQ_FT dengan nilai median
property_data["SQ_FT"] = property_data["SQ_FT"].fillna(med_SQ)
property_data

,lai,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT
0,100001000,104,PUTNAM,Y,3.0,1.0,900.0
1,100002000,197,LXT,N,1.0,1.0,900.0
2,100003000,199,LEXINGTON,N,NaN,1.0,850.0
3,100004000,201,berkeley,Y,1.0,NaN,700.0
4,100004000,201,berkeley,Y,1.0,NaN,700.0
5,100005000,203,BERKELEY,Y,3.0,2.0,975.0
6,100006000,207,Berkeley,Y,NaN,1.0,800.0
7,100007000,209,WASHINGTON,NaN,2.0,1.0,950.0
8,100008000,213,TREMONT,Y,1.0,1.0,900.0
9,100009000,215,TREMONT,Y,NaN,2.0,88000.0
10,100007000,209,WASHINGTON,NaN,2.0,1.0,950.0

In [7]:
# Mencari nilai modus dari kolom NUM_BEDROOMS dan NUM_BATH
mod_NUM_BEDROOMS = property_data["NUM_BEDROOMS"].mode()[0]
mod_NUM_BATH = property_data["NUM_BATH"].mode()[0]

# Menginput NaN pada kolom NUM_BEDROOMS dan NUM_BATH dengan nilai modusnya masing-masing
property_data["NUM_BEDROOMS"] = property_data["NUM_BEDROOMS"].fillna(mod_NUM_BEDROOMS)
property_data["NUM_BATH"] = property_data["NUM_BATH"].fillna(mod_NUM_BATH)
property_data

,lai,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT
0,100001000,104,PUTNAM,Y,3.0,1.0,900.0
1,100002000,197,LXT,N,1.0,1.0,900.0
2,100003000,199,LEXINGTON,N,1.0,1.0,850.0
3,100004000,201,berkeley,Y,1.0,1.0,700.0
4,100004000,201,berkeley,Y,1.0,1.0,700.0
5,100005000,203,BERKELEY,Y,3.0,2.0,975.0
6,100006000,207,Berkeley,Y,1.0,1.0,800.0
7,100007000,209,WASHINGTON,NaN,2.0,1.0,950.0
8,100008000,213,TREMONT,Y,1.0,1.0,900.0
9,100009000,215,TREMONT,Y,1.0,2.0,88000.0
10,100007000,209,WASHINGTON,NaN,2.0,1.0,950.0

In [8]:
# Mencari nilai modus dari kolom OWN_OCCUPIED
mod_OWN_OCCUPIED = property_data["OWN_OCCUPIED"].mode()[0]

# Menginput Modus pada kolom OWN_OCCUPIED
property_data["OWN_OCCUPIED"] = property_data["OWN_OCCUPIED"].fillna(mod_OWN_OCCUPIED)
property_data

,lai,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT
0,100001000,104,PUTNAM,Y,3.0,1.0,900.0
1,100002000,197,LXT,N,1.0,1.0,900.0
2,100003000,199,LEXINGTON,N,1.0,1.0,850.0
3,100004000,201,berkeley,Y,1.0,1.0,700.0
4,100004000,201,berkeley,Y,1.0,1.0,700.0
5,100005000,203,BERKELEY,Y,3.0,2.0,975.0
6,100006000,207,Berkeley,Y,1.0,1.0,800.0
7,100007000,209,WASHINGTON,Y,2.0,1.0,950.0
8,100008000,213,TREMONT,Y,1.0,1.0,900.0
9,100009000,215,TREMONT,Y,1.0,2.0,88000.0
10,100007000,209,WASHINGTON,Y,2.0,1.0,950.0